garyPenhook/PIC-Assembler/Microchip.PIC12-16F1xxx_DFP.1.8.254.atpack_FILES/edc/PIC16F1716.PIC
    <edc:RemappablePin edc:direction="out" edc:ppsports="A C">
      <edc:VirtualPin edc:name="C1OUT"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out" edc:ppsports="A C">
      <edc:VirtualPin edc:name="C2OUT"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in" edc:ppsports="B C">
      <edc:VirtualPin edc:name="CCP1"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out" edc:ppsports="B C">
      <edc:VirtualPin edc:name="CCP1" edc:ppsval="0"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in" edc:ppsports="B C">
      <edc:VirtualPin edc:name="CCP2"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out" edc:ppsports="B C">
      <edc:VirtualPin edc:name="CCP2" edc:ppsval="0"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in" edc:ppsports="B C">
      <edc:VirtualPin edc:name="T1G"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in" edc:ppsports="A C">
      <edc:VirtualPin edc:name="T1CKI"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in" edc:ppsports="A B">
      <edc:VirtualPin edc:name="T0CKI"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out" edc:ppsports="A C">
      <edc:VirtualPin edc:name="NCOOUT"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out" edc:ppsports="B C">
      <edc:VirtualPin edc:name="PWM3OUT"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out" edc:ppsports="B C">
      <edc:VirtualPin edc:name="PWM4OUT"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in" edc:ppsports="B C">
      <edc:VirtualPin edc:name="COGIN"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out" edc:ppsports="B C">
      <edc:VirtualPin edc:name="COG1A"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out" edc:ppsports="B C">
      <edc:VirtualPin edc:name="COG1B"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out" edc:ppsports="B C">
      <edc:VirtualPin edc:name="COG1C"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out" edc:ppsports="B C">
      <edc:VirtualPin edc:name="COG1D"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in" edc:ppsports="B C">
      <edc:VirtualPin edc:name="SDA"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out" edc:ppsports="B C">
      <edc:VirtualPin edc:name="SDA" edc:ppsval="0"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in" edc:ppsports="B C">
      <edc:VirtualPin edc:name="SDI"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in" edc:ppsports="B C">
      <edc:VirtualPin edc:name="SCK"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out" edc:ppsports="B C">
      <edc:VirtualPin edc:name="SCK" edc:ppsval="0"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in" edc:ppsports="B C">
      <edc:VirtualPin edc:name="SCL"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out" edc:ppsports="B C">
      <edc:VirtualPin edc:name="SCL" edc:ppsval="0"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out" edc:ppsports="B C">
      <edc:VirtualPin edc:name="SDO"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in" edc:ppsports="A C">
      <edc:VirtualPin edc:name="SS"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in" edc:ppsports="B C">
      <edc:VirtualPin edc:name="RX"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out" edc:ppsports="B C">
      <edc:VirtualPin edc:name="DT"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out" edc:ppsports="B C">
      <edc:VirtualPin edc:name="TX"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in" edc:ppsports="B C">
      <edc:VirtualPin edc:name="CK"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out" edc:ppsports="B C">
      <edc:VirtualPin edc:name="CK" edc:ppsval="0"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in" edc:ppsports="A C">
      <edc:VirtualPin edc:name="CLCIN0"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in" edc:ppsports="A C">
      <edc:VirtualPin edc:name="CLCIN1"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in" edc:ppsports="B C">
      <edc:VirtualPin edc:name="CLCIN2"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in" edc:ppsports="B C">
      <edc:VirtualPin edc:name="CLCIN3"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out" edc:ppsports="B C">
      <edc:VirtualPin edc:name="CLC4OUT"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out" edc:ppsports="B C">
      <edc:VirtualPin edc:name="CLC3OUT"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out" edc:ppsports="A C">
      <edc:VirtualPin edc:name="CLC2OUT"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out" edc:ppsports="A C">
      <edc:VirtualPin edc:name="CLC1OUT"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in" edc:ppsports="A B">
      <edc:VirtualPin edc:name="INT"/>
    </edc:RemappablePin>
  </edc:PinList>
</edc:PIC>
